Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: Once you have created a tree of views, there are typically a few types of common operations you may wish to perform:
zh_cn: 一旦你创建了一个 view 树，代表一些通用的操作你可能希望完成。

source: Once you have your object creation and measuring code defined, you can implement onDraw().
zh_cn: 一旦定义了对象创建和测量代码，就可以实现 onDraw()。

source: Once you've implemented GestureDetector.OnGestureListener and created an instance of GestureDetector, you can use your GestureDetector to interpret the touch events you receive in onTouchEvent().
zh_cn: 一旦实现了 GestureDetector.OnGestureListener 并创建了 GestureDetector 的实例，就可以使用 GestureDetector 解释你在 onTouchEvent() 中收到的触摸事件。

source: Once you’ve made the appropriate settings, you can easily search for the correct term to see the time.
zh_cn: 完成适当的设置后，你可以轻松搜索正确的术语以查看时间。

source: One Source even used simultaneously in multiple threads.
zh_cn: 一个 Source 甚至在多个线程中同时使用。

source: One common way is for the client app to start your app by calling startActivityResult(), which sends an Intent to your app to start an Activity in your app.
zh_cn: 一种常见的方式是客户端应用程序通过调用 startActivityResult() 来启动你的应用程序，该程序发送 Intent 到你的应用程序，在你的应用程序中启动 Activity 。

source: One of the purposes of this class is to provide a surface in which a secondary thread can render into the screen.
zh_cn: 此类的目的之一是提供一个 surface，其中辅助线程可以呈现到屏幕中。

source: One of the simple ways to make your APK smaller is to reduce the number and size of the resources it contains.
zh_cn: 使 APK 更小的一种简单方法是减少其包含的资源的数量和大小。

source: Only ColorSpace.Model.RGB color spaces are currently supported.
zh_cn: 目前仅支持 ColorSpace.Model.RGB 颜色空间。

source: Only equal sized bitmaps are supported, with inSampleSize set to 1.
zh_cn: 仅支持相同大小的位图，inSampleSize 设置为 1。

source: Only one child is shown at a time.
zh_cn: 一次只能展示一个子项。

source: Only perform take click actions if we were in the pressed state
zh_cn: 仅当我们处于按下状态时才执行点击操作

source: Only the last call to this or setTargetSampleSize(int) is respected.
zh_cn: 调用该方法或 setTargetSampleSize(int) ，只有最后一次有效。

source: Only the last call to this or setTargetSize(int, int) is respected.
zh_cn: 调用该方法或 setTargetSize(int, int) ，只有最后一次有效。

source: Open a data stream for reading a raw resource.
zh_cn: 打开数据流以读取原始资源。

source: Open a file descriptor for reading a raw resource.
zh_cn: 打开文件描述符以读取原始资源。

source: Open your layout in Android Studio and click the Design tab at the bottom of the editor window.
zh_cn: 在 Android Studio 打开你的布局，点击编辑窗口底部的 Design 标签。

source: Optional parameter, use null to identify a "full" update
zh_cn: 可选参数，使用 null 标识“完全”更新

source: Optionally wraps, traces, and/or error-checks the renderer's OpenGL calls.
zh_cn: 可选地包装、跟踪和/或错误检查渲染器的 OpenGL 调用。

source: Optionally, you can also specify an View.OnClickListener for it.
zh_cn: 或者，你也可以为其指定 View.OnClickListener。

source: Optionally, you can also specify an View.OnClickListener, an TextInputLayout.OnEditTextAttachedListener and an TextInputLayout.OnEndIconChangedListener.
zh_cn: 可选地，你还可以指定 View.OnClickListener，TextInputLayout.OnEditTextAttachedListener 和 TextInputLayout.OnEndIconChangedListener。

source: Options for scaling the bounds of an image to the bounds of this view.
zh_cn: 用于将图像边界缩放到 view 边界的选项。

source: Order Import Statements
zh_cn: 为 import 语句排序

source: Order position
zh_cn: 顺序定位

source: Orientation of the SlidingDrawer.
zh_cn: SlidingDrawer 的方向。

source: Originally, there was no style requirement on the ordering, meaning IDEs were either always changing the ordering or IDE developers had to disable the automatic import management features and manually maintain the imports.
zh_cn: 最初对于语句顺序并没有样式要求，这意味着 IDE 经常会改变顺序，或者 IDE 开发者必须停用自动导入管理功能并手动维护导入语句。

source: Other on... methods may also be overridden as required.
zh_cn: 如果需要，其他的 on... 方法也可能需要重写。

source: Other challenges during app initialization include garbage-collection events that are impactful or numerous, or disk I/O happening concurrently with initialization, further blocking the initialization process.
zh_cn: 应用程序初始化期间的其他挑战包括有影响或数量众多的垃圾收集事件，或者与初始化同时发生的磁盘 I/O，进一步阻止了初始化过程。

source: Other child views which are set to dodge the same inset edges will be moved appropriately so that the views do not overlap.
zh_cn: 设置为躲避相同插入边缘的其他子 view 将被适当移动，以使 view 不重叠。

source: Other fields start with a lower case letter.
zh_cn: 其他字段以小写字母开头。

source: Other horizontally scrolling widgets include HorizontalScrollView and ViewPager from the support library.
zh_cn: 其他水平滚动小部件包括来自支持库的 HorizontalScrollView 和 ViewPager。

source: Other progress bar styles provided by the system include:
zh_cn: 系统提供的其他进度条样式包括：

source: Other view subclasses offer more specialized listeners.
zh_cn: 其他的 view 子类提供更专门的监听器。

source: Other views that are touchable, like buttons, will not take focus when touched; they will only fire the on click listeners.
zh_cn: 其他可触摸的 view，比如按钮，在触摸时将不获取焦点，他们只会解发按键监听器。

source: Otherwise an IllegalStateException will be thrown by decodeDrawable/decodeBitmap.
zh_cn: 否则，IllegalStateException 将由decodeDrawable/decodeBitmap 抛出。

source: Otherwise this call has no effect.
zh_cn: 否则此调用无效。

source: Otherwise, this color will be overlaid on the button at a 50% opacity when button is pressed.
zh_cn: 否则，按下按钮时，此颜色将以 50％不透明度覆盖在按钮上。

source: Otherwise, use a default value appropriate for the user's locale, such as HH:mm
zh_cn: 否则，使用适合用户区域设置的默认值，例如 HH:mm

source: Otherwise, use a default value appropriate for the user's locale, such as h:mm a
zh_cn: 否则，使用适合用户区域设置的默认值，例如 h:mm a

source: Otherwise, use the value returned by getFormat12Hour() when non-null
zh_cn: 否则，当非空时，使用 getFormat12Hour() 返回的值

source: Otherwise, use the value returned by getFormat24Hour() when non-null
zh_cn: 否则，当非空时，使用 getFormat24Hour() 返回的值

source: Otherwise, you should enable span index cache (setSpanIndexCacheEnabled(boolean)) for better performance.
zh_cn: 否则，你应该通过(setSpanIndexCacheEnabled(boolean)) 来启用 span index 的缓存以获取更优的性能。

source: Our parting thought: BE CONSISTENT.
zh_cn: 总而言之：保持一致。

source: Outside button Remove any future long press/tap checks
zh_cn: 按钮外部则移除任何未来的长按/tap 检查

source: Overridden Methods
zh_cn: 重写方法

source: Override #onBindViewHolder(ViewHolder, int, List) instead if Adapter can handle efficient partial bind.
zh_cn: 如果适配器可以处理有效的部分绑定，则重写 #onBindViewHolder(ViewHolder, int, List)。

source: Override some of the methods from the superclass.
zh_cn: 重写父类的一些方法。

source: Override this method if you want to support scroll bars.
zh_cn: 重写该方法如果你想要支持滚动条。

source: Override this method to handle the event:
zh_cn: 重写此方法以处理事件：

source: Override to prevent freezing of any views created by the adapter.
zh_cn: 重定以防止 adapter 创建的 view 被冻结。

source: Override to prevent thawing of any views created by the adapter.
zh_cn: 重写以防止 adapter 创建的任何 view 被解冻。

source: Padding can be set using the setPadding(int, int, int, int) or setPaddingRelative(int, int, int, int) method and queried by calling getPaddingLeft(), getPaddingTop(), getPaddingRight(), getPaddingBottom(), getPaddingStart(), getPaddingEnd().
zh_cn: Padding 可以使用 setPadding(int, int, int, int) 或 setPaddingRelative(int, int, int, int) 方法来设置，或使用 getPaddingLeft(), getPaddingTop(), getPaddingRight(), getPaddingBottom(), getPaddingStart(), getPaddingEnd() 等方法获取。

source: Padding can be used to offset the content of the view by a specific amount of pixels.
zh_cn: Padding 可以通过申明一个特定的像素值来偏移 view 的内容。

source: PagerTabStrip is an interactive indicator of the current, next, and previous pages of a ViewPager.
zh_cn: PagerTabStrip 是 ViewPager 的当前页面，下一页面和上一页面的交互式指示器。

source: PagerTitleStrip is a non-interactive indicator of the current, next, and previous pages of a ViewPager.
zh_cn: PagerTitleStrip 是 ViewPager 的当前页面，下一页面和上一页面的非交互式指示器。

source: Paging Library
zh_cn: 分页库

source: Parallax scrolling children
zh_cn: 视差滚动 children

source: Parameterized constructor that takes the view inflation parameters (parameters defined in the XML).
zh_cn: 解析构造方法，以获得加载参数(参数定义在 XML 文件中)。

source: Parameters
zh_cn: 参数

source: Parameters describing the desired layout for a child of a CoordinatorLayout.
zh_cn: 描述 CoordinatorLayout 的子项的所需布局的参数。

source: Parent position
zh_cn: 父布局位置

source: Parse a name/value pair out of an XML tag holding that data.
zh_cn: 从包含该数据的 XML 标记中解析名称/值对。

source: Parse a series of <extra> tags from an XML file.
zh_cn: 从 XML 文件中解析一系列 <extra> 标记。

source: Parse the color string, and return the corresponding color-int.
zh_cn: 解析颜色字符串，并返回相应的 color-int。

source: Parse the xml attributes to get the most common properties used by layout managers.
zh_cn: 解析 xml 属性以获得 layout managers 要使用的最常用的性性。

source: Partial bind vs full bind:
zh_cn: 部分绑定与完全绑定：

source: Pass false to dispatchRecycled for views that have not been bound.
zh_cn: 对于尚未绑定的 view，将 false 传递给 dispatchRecycled。

source: Pass the touch screen motion event down to the target view, or this view if it is the target.
zh_cn: 将触摸动作事件向下传递到目标 view，如果此 view 是目标 view，则传递到此 view。

source: Passing null will reset the shader's matrix to identity.
zh_cn: 传递 null 将重置 shader 的矩阵为同一的。

source: Password visibility toggling via setEndIconMode(int) API and related attribute.
zh_cn: 通过 setEndIconMode(int) API 和相关属性切换密码可见性。

source: Per-child layout information associated with AbsoluteLayout.
zh_cn: 与 AbsoluteLayout 关联的每子布局信息。

source: Per-child layout information associated with ViewLinearLayout.
zh_cn: 与 ViewLinearLayout 关联的每子布局信息。

source: Per-child layout information associated with action bar custom views.
zh_cn: 与操作栏自定义 view 关联的每子布局信息。

source: Per-child layout information for layouts that support margins.
zh_cn: 支持边距的布局的每子布局信息。

source: Perform cleanup after a nested scrolling operation.
zh_cn: 嵌套滚动操作后执行清理。

source: Performance issues can arise during creation of the app and creation of the activity.
zh_cn: 在创建应用程序和创建 activity 期间可能会出现性能问题。

source: Performing the initial draw.
zh_cn: 执行初始绘制。

source: Performs all normal actions associated with clicking: reporting accessibility event, playing a sound, etc.
zh_cn: 执行与点击相关联的所有正常操作：报告无障碍活动，播放声音，等等。

source: Perhaps a graphical VU meter that looks like an old analog gauge, or a sing-a-long text view where a bouncing ball moves along the words so you can sing along with a karaoke machine.
zh_cn: 比如看起来像一个老的模拟表的 VU 图表，或者一个有一个跟随歌词跳动的小球的 text view，就像一个卡拉 ok 机。

source: Perhaps in the case of a Combo box we might use a LinearLayout with horizontal orientation.
zh_cn: 也许在这种情况下，我们可能使用水平方向的 LinearLayout（线性布局）来完成 Combo box。

source: Permissions granted in an Intent remain in effect while the stack of the receiving Activity is active.
zh_cn: 在 Intent 中授予的权限在接收 Activity 的堆栈处于活动状态时保持有效。

source: Permissions granted to one Activity in a client app are automatically extended to other components of that app.
zh_cn: 在客户端应用程序中授予一个 Activity 的权限会自动扩展到该应用程序的其他组件。

source: PieChart has child views, but it never measures them.
zh_cn: PieChart 有子 view，但它从不测量它们。

source: Pinned position children
zh_cn: 固定 children 位置

source: Pixels - Corresponds to actual pixels on the screen.
zh_cn: Pixels（像素） - 对应屏幕上的实际像素。

source: Place object in the horizontal center of its container, not changing its size.
zh_cn: 将对象放在其容器的水平中心，而不更改其大小。

source: Place object in the vertical center of its container, not changing its size.
zh_cn: 将对象放在其容器的垂直中心，而不更改其大小。

source: Place the object in the center of its container in both the vertical and horizontal axis, not changing its size.
zh_cn: 将物体放在其容器的中心，在垂直和水平轴上，不更改其大小。

source: Placing focusable widgets to the left or right of a SeekBar is discouraged.
zh_cn: 不鼓励将可聚焦小部件放置在 SeekBar 的左侧或右侧。

source: Points - 1/72 of an inch based on the physical size of the screen.
zh_cn: Points（点） - 基于屏幕物理尺寸的 1/72 英寸。

source: Population of the tabs to display is done through TabLayout.Tab instances.
zh_cn: 要显示的选项卡的填充是通过 TabLayout.Tab 实例完成的。

source: Position of ViewHolder to be returned.
zh_cn: 要返回 ViewHolder 的位置。

source: Position of the first item that has changed
zh_cn: 已更改的第一个项的位置

source: Position of the first item that was inserted
zh_cn: 插入的第一个项目的位置

source: Position of the item that has changed
zh_cn: 已更改项的位置

source: Position of the item that has now been removed
zh_cn: 已移除的项目的位置

source: Position of the newly inserted item in the data set
zh_cn: 数据集中新插入项的位置

source: Position the scroll bar along the left edge.
zh_cn: 将滚动条沿左边缘放置。

source: Position the scroll bar along the right edge.
zh_cn: 将滚动条沿右边缘放置。

source: Position the scroll bar at the default position as determined by the system.
zh_cn: 将滚动条定位在系统确定的默认位置。

source: Positioning a Guideline is possible in three different ways:
zh_cn: 定位 Guideline 有 3 种不同的方式：

source: Positions in RecyclerView:
zh_cn: RecyclerView 中的位置：

source: Positions the icon can be set to.
zh_cn: 可以将图标的位置设置为。

source: Positive numbers will scroll the content to the left.
zh_cn: 正数（最终结果）会将内容向左滚动。

source: Positive numbers will scroll the content up.
zh_cn: 正数（最终结果）会将内容向上滚动。

source: Possible bitmap configurations.
zh_cn: 可能的位图配置。

source: Potentially reduces the number of import statements.
zh_cn: 可能会减少 import 语句的数量。

source: Prepares the ViewHolder to be removed/recycled, and inserts it into the RecycledViewPool.
zh_cn: 准备要移除/回收的 ViewHolder，并将其插入 RecycledViewPool。

source: Presenting Dynamic Data
zh_cn: 呈现动态数据

source: Previous position of the first item that was removed
zh_cn: 移除的第一个项目的之前位置

source: Previous position of the item.
zh_cn: 项目的上一个位置。

source: Prior to KITKAT additional constraints apply: The image being decoded (whether as a resource or as a stream) must be in jpeg or png format.
zh_cn: 在 KITKAT 之前应用其他约束：正在解码的图像(无论是资源还是流)必须采用 jpeg 或 png 格式。

source: Private information should be avoided.
zh_cn: 应避免提供个人信息，。

source: Procedural rendering frees up space because you no longer store an image file in your APK.
zh_cn: 程序渲染可以释放空间，因为你不再在 APK 中存储图像文件。

source: Processes and Threads
zh_cn: 进程和线程

source: Progress bar supports two modes to represent progress: determinate, and indeterminate.
zh_cn: 进度条支持两种表示进度的模式：确定和不确定。

source: Properties
zh_cn: 属性

source: Protected methods
zh_cn: 受保护的方法

source: Provide custom ordering of views in which the touch will be dispatched.
zh_cn: 提供将在其中发送触摸的 view 的自定义顺序。

source: Provide custom styleable attributes that work with Android XML layouts
zh_cn: 提供适用于 Android XML 布局的自定义 styleable 属性

source: Provides a Material card.
zh_cn: 提供材质 card。

source: Provides a dedicated drawing surface embedded inside of a view hierarchy.
zh_cn: 提供嵌入 view 层次结构内部的专用绘制 surface。

source: Provides a widget for selecting a date.
zh_cn: 提供用于选择日期的小部件。

source: Provides the glue to show AppWidget views.
zh_cn: 提供显示 AppWidget view 的粘合剂。

source: Providing null will disable the scrim functionality.
zh_cn: 提供 null 将禁用稀松布功能。

source: Public constructors
zh_cn: 公共构造方法

source: Public methods
zh_cn: 公共方法

source: Public methods are part of an API and therefore require Javadoc.
zh_cn: 公开方法是 API 的一部分，因此需要 Javadoc。

source: Public static final fields (constants) are ALL_CAPS_WITH_UNDERSCORES.
zh_cn: 公开静态 final 字段(常量)为全部大写并用下划线连接 (ALL_CAPS_WITH_UNDERSCORES)。

source: Public version un-scraps before calling recycle.
zh_cn: 在调用回收之前取消废弃的公共版本。

source: Push object to the bottom of its container, not changing its size.
zh_cn: 将对象推到其容器的底部，而不是更改其大小。

source: Push object to the left of its container, not changing its size.
zh_cn: 将对象推到其容器的左侧，而不更改其大小。

source: Push object to the right of its container, not changing its size.
zh_cn: 将对象推到其容器的右侧，而不更改其大小。

source: Push object to the top of its container, not changing its size.
zh_cn: 将对象推到其容器的顶部，而不更改其大小。

source: Put the <paths> element and its children in an XML file in your project.
zh_cn: 将 <paths> 元素及其子元素放在项目中的 XML 文件中。

source: Put the content URI in an Intent by calling setData().
zh_cn: 通过调用 setData() 将 content URI 放入 Intent 中。

source: Puts a key/value pair into the array, optimizing for the case where the key is greater than all existing keys in the array.
zh_cn: 将键/值对放入数组中，对键大于数组中所有现有键的情况进行优化。

source: Queries the anchoring of region bounds for this matcher.
zh_cn: 查询此匹配器区域界限的定位。

source: Queries the transparency of region bounds for this matcher.
zh_cn: 查询此匹配器区域边界的透明度。

source: Query if horizontal scrolling is currently supported.
zh_cn: 查询当前是否支持水平滚动。

source: Query if vertical scrolling is currently supported.
zh_cn: 查询当前是否支持竖直滚动。

source: Radio buttons are normally used together in a RadioGroup.
zh_cn: 单选按钮通常在 RadioGroup 中一起使用。

source: Rasterizing VectorDrawable objects.
zh_cn: 栅格化 VectorDrawable 对象。

source: Ratio
zh_cn: 比例

source: React to a descendant view initiating a nestable scroll operation, claiming the nested scroll operation if appropriate.
zh_cn: 对启动可嵌套滚动操作的后代 view 作出反应，声明嵌套滚动操作(如果适用)。

source: React to a nested fling before the target view consumes it.
zh_cn: 在目标 view 消耗 fling 之前对嵌套的 fling 做出反应。

source: React to a nested scroll in progress before the target view consumes a portion of the scroll.
zh_cn: 在目标 view 消耗滚动的一部分之前，对正在进行的嵌套滚动作出反应。

source: React to a nested scroll in progress.
zh_cn: 对正在进行的嵌套滚动做出反应。

source: React to a nested scroll operation ending.
zh_cn: 对嵌套滚动操作结束的反应。

source: React to the successful claiming of a nested scroll operation.
zh_cn: 对成功声明嵌套滚动操作做出反应。

source: Reattach a previously detached view.
zh_cn: 重新附加一个之前被 detached 的 view。

source: Recycle a detached view.
zh_cn: 回收一个分离的 view。

source: Recycle them all
zh_cn: 全部回收

source: Recycle this scrap.
zh_cn: 回收此废料。

source: Recycled view pools allow multiple RecyclerViews to share a common pool of scrap views.
zh_cn: 复用的 view 池允许多个 RecyclerViews 共享一个公共的废弃的 view 池。

source: RecycledViewPool lets you share Views between multiple RecyclerViews.
zh_cn: RecycledViewPool 允许你在多个 RecyclerViews 间共享数据。

source: RecyclerView calls this method right before clearing ViewHolder's internal data and sending it to RecycledViewPool.
zh_cn: RecyclerView 在清除 ViewHolder 的内部数据并将其发送到 RecycledViewPool 之前调用此方法。

source: RecyclerView can perform several optimizations if it can know in advance that RecyclerView's size is not affected by the adapter contents.
zh_cn: RecyclerView 可以执行一些优化，如果它可以预先知道 RecyclerView 的尺寸不受 adapter 内容的影响。

source: RecyclerView does not implement scrolling logic, rather forwards the call to scrollToPosition(int)
zh_cn: RecyclerView 不实现滚动逻辑，而是将调用转发到 scrollToPosition(int)

source: RecyclerView introduces an additional level of abstraction between the RecyclerView.Adapter and RecyclerView.LayoutManager to be able to detect data set changes in batches during a layout calculation.
zh_cn: RecyclerView 在 RecyclerView.Adapter 和 RecyclerView.LayoutManager 之间引入了一个额外的抽象层，用于在布局计算时批量地检测数据集的变化。

source: RecyclerView will re-bind the returned View to the position if necessary.
zh_cn: 如有必要，RecyclerView 会将返回的 view 重新绑定到位置。

source: Recycles a cached view and removes the view from the list.
zh_cn: 回收缓存 view 并从列表中移除该 view。

source: Reduce native and Java code
zh_cn: 减少 native 和 Java 代码

source: Reduce resource count and size
zh_cn: 减少资源数量和大小

source: Reduce the APK size
zh_cn: 减少 APK 大小

source: Reduce the size of native binaries
zh_cn: 减少 native 二进制文件的大小

source: Refactor your code to have more fine-grained error handling, with multiple try blocks.
zh_cn: 通过多个 try 块重构你的代码，使得错误处理过程更精细。

source: Refer to ViewGroup and ViewGroup.MarginLayoutParams for further information.
zh_cn: 参见 ViewGroup 和 ViewGroup.MarginLayoutParams 了解更多信息。

source: Refer to setCameraDistance(float) for more information.
zh_cn: 有关更多信息，请参阅 setCameraDistance(float)。

source: Reference to a theme that should be used to inflate popups shown by widgets in the toolbar.
zh_cn: 引用应该用于对工具栏中的小部件显示的弹出窗口进行通知的主题。

source: Reference to an array resource that will populate the ListView.
zh_cn: 引用将填充 ListView 的数组资源。

source: Reference to an array resource that will populate the Spinner.
zh_cn: 引用将填充 Spinner 的数组资源。

source: References the data that will be used to decode a Drawable or Bitmap in decodeDrawable or decodeBitmap.
zh_cn: 引用将在 decodeDrawable 或 decodeBitmap 中用来解码为 Drawable 或 Bitmap 的数据。

source: References the id of the parent.
zh_cn: 引用 parent 的 id。

source: Regarding the Dark Theme elevation overlays, it's important to note that the Material AppBarLayout component also provides elevation overlay support, and operates under the assumption that the child Toolbar does not have a background.
zh_cn: 关于 Dark Theme 高程叠加，重要的是要注意 Material AppBarLayout 组件还提供高程覆盖支持，并在假设子 Toolbar 没有背景。

source: Regardless of how GridLayout is configured, grid index 0 is fixed to the leading edge of the container and grid index N is fixed to its trailing edge (after padding is taken into account).
zh_cn: 无论如何配置 GridLayout，网格索引 0 固定到容器的前沿，并且网格索引 N 固定为其后沿（在考虑填充之后）。

source: Register a listener that will be notified whenever a child view is attached to or detached from RecyclerView.
zh_cn: 注册一个监听器, 当子组件被附加或者从 RecycleView 中移除时, 会得到一个相关的通知。

source: Register a listener that will be notified whenever a child view is recycled.
zh_cn: 注册一个监听器以监听一个子 view 是否被回收。

source: Register a new observer to listen for data changes.
zh_cn: 注册一个新的观察者来监听数据更改。

source: Related Documentation
zh_cn: 相关文档

source: Related XML Attributes:
zh_cn: 相关的 XML 属性：

source: Related methods:
zh_cn: 相关方法：

source: Relative positioning
zh_cn: 相对定位

source: Relative positioning is one of the basic building block of creating layouts in ConstraintLayout.
zh_cn: 相对定位是在 ConstraintLayout 中创建布局的基本构建块之一。

source: Rely on notifyDataSetChanged() as a last resort.
zh_cn: 依靠 notifyDataSetChanged() 作为最后的手段。

source: Remember that other layouts can be nested inside, so the compound component can be arbitrarily complex and structured.
zh_cn: 请记住其他的布局可以在内部任意嵌套，所以组件可以任意的复杂和构造。

source: Remember: exceptions are your friend!
zh_cn: 请谨记：异常是你的朋友！

source: Remove a constraint from this view.
zh_cn: 从 view 中删除约束。

source: Remove a listener that was notified of any changes in scroll state or position.
zh_cn: 移除一个监听滚动状态及位置变化的监听器。

source: Remove a menu visibility listener.
zh_cn: 移除菜单可见性监听器。

source: Remove a page for the given position.
zh_cn: 移除给定位置的页面。

source: Remove a previously scrapped view from the pool of eligible scrap.
zh_cn: 从符合条件的废料池中移除之前废弃的 view。

source: Remove a range of mappings as a batch.
zh_cn: 将一系列映射作为批处理移除。

source: Remove all constraints from this view.
zh_cn: 从 view 中删除所有约束。

source: Remove all secondary listener that were notified of any changes in scroll state or position.
zh_cn: 移除所有二级的，监听任意滚动状态或位置变化的监听器。

source: Remove an RecyclerView.ItemDecoration from this RecyclerView.
zh_cn: 移除该 RecyclerView 的一个 RecyclerView.ItemDecoration。

source: Remove an RecyclerView.OnItemTouchListener.
zh_cn: 移除一个 RecyclerView.OnItemTouchListener。

source: Remove count
zh_cn: 移除计数

source: Remove debug symbols
zh_cn: 移除调试符号

source: Remove start index
zh_cn: 移除开始索引

source: Remove the previously added AppBarLayout.OnOffsetChangedListener.
zh_cn: 移除以前添加的 AppBarLayout.OnOffsetChangedListener。

source: Remove unnecessary generated code
zh_cn: 移除不必要的生成代码

source: Remove unused resources
zh_cn: 移除未使用的资源

source: Removed view for recycling
zh_cn: 移除 view 以进行回收

source: Removes a view from a horizontal chain.
zh_cn: 从水平链中删除 view。

source: Removes a view from a vertical chain.
zh_cn: 从垂直链中删除 view。

source: Removes all key-value mappings from this SparseArray.
zh_cn: 移除此 SparseArray 所有键值映射关系。

source: Removes all listeners that were added via addOnChildAttachStateChangeListener(OnChildAttachStateChangeListener).
zh_cn: 移除所有通过 addOnChildAttachStateChangeListener(OnChildAttachStateChangeListener) 添加的监听器。

source: Removes the mapping at the specified index.
zh_cn: 移除指定索引处的映射。

source: Removes the mapping from the specified key, if there was any.
zh_cn: 从指定键中移除映射(如果有)。

source: Removes the provided listener from child attached state listeners list.
zh_cn: 移除提供的 listener 从子 view 附加的状态监听器列表。

source: Render from code
zh_cn: 从代码渲染

source: Renders on a dedicated thread to decouple rendering performance from the UI thread.
zh_cn: 在专用线程上呈现以将呈现性能与 UI 线程分离。

source: Replace the contents of this with the contents of src.
zh_cn: 用 src 的内容替换它的内容。
